miketeachman/micropython/ports/mimxrt/machine_i2s.c
#if 0
void HAL_I2S_RxCpltCallback(I2S_HandleTypeDef *hi2s) {
    machine_i2s_obj_t *self;
    if (hi2s->Instance == I2S1) {
        self = MP_STATE_PORT(machine_i2s_obj)[0];
    } else {
        self = MP_STATE_PORT(machine_i2s_obj)[1];
    }
    // bottom half of buffer now filled,
    // safe to empty the bottom half while the top half of buffer is being filled
    empty_dma(self, BOTTOM_HALF);

    // for non-blocking operation, this IRQ-based callback handles
    // the readinto() method requests.
    if ((self->io_mode == NON_BLOCKING) && (self->non_blocking_descriptor.copy_in_progress)) {
        fill_appbuf_from_ringbuf_non_blocking(self);
    }
}
#endif

#if 0
void HAL_I2S_RxHalfCpltCallback(I2S_HandleTypeDef *hi2s) {
    machine_i2s_obj_t *self;
    if (hi2s->Instance == I2S1) {
        self = MP_STATE_PORT(machine_i2s_obj)[0];
    } else {
        self = MP_STATE_PORT(machine_i2s_obj)[1];
    }
    // top half of buffer now filled,
    // safe to empty the top half while the bottom half of buffer is being filled
    empty_dma(self, TOP_HALF);

    // for non-blocking operation, this IRQ-based callback handles
    // the readinto() method requests.
    if ((self->io_mode == NON_BLOCKING) && (self->non_blocking_descriptor.copy_in_progress)) {
        fill_appbuf_from_ringbuf_non_blocking(self);
    }
}
#endif

void HAL_I2S_TxCpltCallback(machine_i2s_obj_t *self) {
    // for non-blocking operation, this IRQ-based callback handles
    // the write() method requests.
    if ((self->io_mode == NON_BLOCKING) && (self->non_blocking_descriptor.copy_in_progress)) {
        copy_appbuf_to_ringbuf_non_blocking(self);
    }

    // bottom half of buffer now emptied,
    // safe to fill the bottom half while the top half of buffer is being emptied
    feed_dma(self, BOTTOM_HALF);
}

void HAL_I2S_TxHalfCpltCallback(machine_i2s_obj_t *self) {
    // for non-blocking operation, this IRQ-based callback handles
    // the write() method requests.
    if ((self->io_mode == NON_BLOCKING) && (self->non_blocking_descriptor.copy_in_progress)) {
        copy_appbuf_to_ringbuf_non_blocking(self);
    }

    // top half of buffer now emptied,
    // safe to fill the top half while the bottom half of buffer is being emptied
    feed_dma(self, TOP_HALF);
}


// output ~200us pulse
void diag_pulse_gpio(uint16_t pin_num) {
    const machine_pin_obj_t *pin = machine_pin_board_pins[pin_num];

    for (uint32_t i=0; i<10000; i++) {
        mp_hal_pin_high(pin);
    }

    mp_hal_pin_low(pin);
}



    /*! @brief Define callback function for eDMA.
     *
     * This callback function is called in the EDMA interrupt handle.
     * In normal mode, run into callback function means the transfer users need is done.
     * In scatter gather mode, run into callback function means a transfer control block (tcd) is finished. Not
     * all transfer finished, users can get the finished tcd numbers using interface EDMA_GetUnusedTCDNumber.
     *
     * @param handle EDMA handle pointer, users shall not touch the values inside.
     * @param userData The callback user parameter pointer. Users can use this parameter to involve things users need to
     *                 change in EDMA callback function.
     * @param transferDone If the current loaded transfer done. In normal mode it means if all transfer done. In scatter
     *                     gather mode, this parameter shows is the current transfer block in EDMA register is done. As the
     *                     load of core is different, it will be different if the new tcd loaded into EDMA registers while
     *                     this callback called. If true, it always means new tcd still not loaded into registers, while
     *                     false means new tcd already loaded into registers.
     * @param tcds How many tcds are done from the last callback. This parameter only used in scatter gather mode. It
     *             tells user how many tcds are finished between the last callback and this.
     */
    //typedef void (*edma_callback)(struct _edma_handle *handle, void *userData, bool transferDone, uint32_t tcds);


/* User callback function for EDMA transfer. */
void EDMA_TX_Callback(edma_handle_t *handle, void *userData, bool transferDone, uint32_t tcds)
{
    machine_i2s_obj_t *self = userData;
    //mp_printf(MP_PYTHON_PRINTER, "i2s_id = %d, transferDone = %d\n", self->i2s_id, transferDone);

    // pulse GPIO pin
    //diag_pulse_gpio(32);

    if (transferDone)
    {
        HAL_I2S_TxCpltCallback(self);
    }
    else
    {
        HAL_I2S_TxHalfCpltCallback(self);
    }
}


STATIC bool i2s_init(machine_i2s_obj_t *self) {
    
    CLOCK_InitAudioPll(&audioPllConfig);
    
    CLOCK_SetMux(i2s_clock_mux[self->i2s_hw_id], SAI_CLOCK_SOURCE_SELECT);
    CLOCK_SetDiv(i2s_clock_pre_div[self->i2s_hw_id], SAI_CLOCK_SOURCE_PRE_DIVIDER);
    CLOCK_SetDiv(i2s_clock_div[self->i2s_hw_id], SAI_CLOCK_SOURCE_DIVIDER);

    i2s_set_iomux(self->i2s_hw_id);
    
    int chan = allocate_dma_channel();
    DMAMUX_Init(DMAMUX0);
    // TODO this only covers Tx, need to switch on i2s mode
    DMAMUX_SetSource(DMAMUX, chan, i2s_dma_req_src_tx[self->i2s_hw_id]);
    DMAMUX_EnableChannel(DMAMUX0, chan);
    
    edma_config_t dmaConfig;
    memset(&dmaConfig, 0, sizeof(dmaConfig));
    EDMA_GetDefaultConfig(&dmaConfig);
    EDMA_Init(DMA0, &dmaConfig);  // TODO SPI has this init as well; will this conflict with SPI operation?

    EDMA_CreateHandle(&g_dmaHandle, DMA0, chan);
    EDMA_SetCallback(&g_dmaHandle, EDMA_TX_Callback, self);
    EDMA_ResetChannel(DMA0, chan);
    
    SAI_Init(self->i2s_inst);
    
    sai_transceiver_t saiConfig;
    memset(&saiConfig, 0, sizeof(saiConfig));
    SAI_GetClassicI2SConfig(&saiConfig, get_dma_bits(self->mode, self->bits), kSAI_Stereo, 1U << DEMO_SAI_CHANNEL);
    saiConfig.syncMode    = kSAI_ModeAsync;
    saiConfig.masterSlave = kSAI_Master;

    SAI_TxSetConfig(self->i2s_inst, &saiConfig);
    SAI_TxSetBitClockRate(self->i2s_inst, DEMO_AUDIO_MASTER_CLOCK, self->rate, get_dma_bits(self->mode, self->bits),
                          DEMO_AUDIO_DATA_CHANNEL);
    
    MP_HAL_CLEAN_DCACHE(self->dma_buffer_dcache_aligned, SIZEOF_DMA_BUFFER_IN_BYTES);

    uint32_t destAddr = SAI_TxGetDataRegisterAddress(self->i2s_inst, DEMO_SAI_CHANNEL);


    edma_transfer_config_t transferConfig;
    memset(&transferConfig, 0, sizeof(transferConfig));
    uint8_t bytes_per_sample = get_dma_bits(self->mode, self->bits) / 8;
    EDMA_PrepareTransfer(&transferConfig,
            self->dma_buffer_dcache_aligned, bytes_per_sample,
            (void *)destAddr, bytes_per_sample,
            (FSL_FEATURE_SAI_FIFO_COUNT - saiConfig.fifo.fifoWatermark) * bytes_per_sample,
            SIZEOF_DMA_BUFFER_IN_BYTES, kEDMA_MemoryToPeripheral);
    memset(&s_emdaTcd, 0, sizeof(s_emdaTcd));

    // use scatter/gather feature, with one TCD linked back to itself.
    // TODO rename variables such as s_emdaTcd, g_dmaHandle
    EDMA_TcdSetTransferConfig(&s_emdaTcd, &transferConfig, &s_emdaTcd);
    EDMA_TcdEnableInterrupts(&s_emdaTcd, kEDMA_MajorInterruptEnable | kEDMA_HalfInterruptEnable);
    EDMA_InstallTCD(DMA0, chan, &s_emdaTcd);
    EDMA_StartTransfer(&g_dmaHandle);

    SAI_TxEnableDMA(self->i2s_inst, kSAI_FIFORequestDMAEnable, true);
    SAI_TxEnable(self->i2s_inst, true);
    SAI_TxSetChannelFIFOMask(self->i2s_inst, 1U << DEMO_SAI_CHANNEL);

    return true;  // TODO to get it compiling
}

STATIC void machine_i2s_init_helper(machine_i2s_obj_t *self, size_t n_pos_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {

    enum {
        ARG_sck,
        ARG_ws,
        ARG_sd,
        ARG_mode,
        ARG_bits,
        ARG_format,
        ARG_rate,
        ARG_ibuf,
    };

    static const mp_arg_t allowed_args[] = {
        { MP_QSTR_sck,      MP_ARG_KW_ONLY | MP_ARG_REQUIRED | MP_ARG_OBJ,   {.u_obj = MP_OBJ_NULL} },
        { MP_QSTR_ws,       MP_ARG_KW_ONLY | MP_ARG_REQUIRED | MP_ARG_OBJ,   {.u_obj = MP_OBJ_NULL} },
        { MP_QSTR_sd,       MP_ARG_KW_ONLY | MP_ARG_REQUIRED | MP_ARG_OBJ,   {.u_obj = MP_OBJ_NULL} },
        { MP_QSTR_mode,     MP_ARG_KW_ONLY | MP_ARG_REQUIRED | MP_ARG_INT,   {.u_int = -1} },
        { MP_QSTR_bits,     MP_ARG_KW_ONLY | MP_ARG_REQUIRED | MP_ARG_INT,   {.u_int = -1} },
        { MP_QSTR_format,   MP_ARG_KW_ONLY | MP_ARG_REQUIRED | MP_ARG_INT,   {.u_int = -1} },
        { MP_QSTR_rate,     MP_ARG_KW_ONLY | MP_ARG_REQUIRED | MP_ARG_INT,   {.u_int = -1} },
        { MP_QSTR_ibuf,     MP_ARG_KW_ONLY | MP_ARG_REQUIRED | MP_ARG_INT,   {.u_int = -1} },
    };

    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all(n_pos_args, pos_args, kw_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args);

    //
    // ---- Check validity of arguments ----
    //

